ExchangePlans/ПланОбменаСправочники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ExchangePlan>
		<Properties>
			<Name>ПланОбменаСправочники</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборКонтрагентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ПланОбменаСправочники/Forms/ФормаУзла/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьТаблицОтборов();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обновление заголовка после сохранения
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьОтборНоменклатурыПриИзменении(Элемент)
	УстановитьДоступностьТаблицОтборовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборКонтрагентовПриИзменении(Элемент)
	УстановитьДоступностьТаблицОтборовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьТаблицОтборов()
	Элементы.ОтборыНоменклатуры.Доступность     = Объект.ИспользоватьОтборНоменклатуры;
	Элементы.ОтборыНоменклатуры.Видимость     = Объект.ИспользоватьОтборНоменклатуры;
	Элементы.ОтборыКонтрагентов.Доступность     = Объект.ИспользоватьОтборКонтрагентов;
	Элементы.ОтборыКонтрагентов.Видимость     = Объект.ИспользоватьОтборКонтрагентов;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьТаблицОтборовНаСервере()
	УстановитьДоступностьТаблицОтборов();
КонецПроцедуры

#КонецОбласти
